RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
/**
 *******************************************************************************
 * @file  hc32f4a0_tmr2.c
 * @brief This file provides firmware functions to manage the TMR2(Timer2).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_tmr2.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TMR2 TMR2
 * @brief TMR2 Driver Library
 * @{
 */
#if (DDL_TMR2_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR2_Local_Macros TMR2 Local Macros
 * @{
 */

/**
 * @defgroup TMR2_Configuration_Bit_Mask TMR2 Configuration Bit Mask
 * @{
 */
#define TMR2_BCONR_INIT_MSK                 (TMR2_BCONR_CAPMDA | TMR2_BCONR_SYNSA | TMR2_BCONR_SYNCLKA | TMR2_BCONR_ASYNCLKA | \
                                             TMR2_BCONR_CKDIVA | TMR2_BCONR_SYNCLKAT_0 | TMR2_BCONR_SYNCLKAT_1)
#define TMR2_FUNC_MODE_MSK                  (TMR2_BCONR_CAPMDA)
#define TMR2_CLK_SRC_MSK                    (TMR2_BCONR_SYNSA |TMR2_BCONR_SYNCLKA |TMR2_BCONR_ASYNCLKA | TMR2_BCONR_SYNCLKAT_0 | \
                                             TMR2_BCONR_SYNCLKAT_1)
#define TMR2_CLK_DIV_MSK                    (TMR2_BCONR_CKDIVA)
#define TMR2_PWM_START_POLARITY_MSK         (TMR2_PCONR_STACA)
#define TMR2_PWM_STOP_POLARITY_MSK          (TMR2_PCONR_STPCA)
#define TMR2_PWM_CMP_POLARITY_MSK           (TMR2_PCONR_CMPCA)
#define TMR2_PWM_POLARITY_MSK               (TMR2_PCONR_STACA | TMR2_PCONR_STPCA | TMR2_PCONR_CMPCA)
#define TMR2_FILTER_CLK_DIV_MSK             (TMR2_PCONR_NOFICKA)
#define TMR2_START_COND_MSK                 (TMR2_HCONR_HSTAA0 | TMR2_HCONR_HSTAA1 | TMR2_HCONR_HSTAA2)
#define TMR2_STOP_COND_MSK                  (TMR2_HCONR_HSTPA0 | TMR2_HCONR_HSTPA1 | TMR2_HCONR_HSTPA2)
#define TMR2_CLR_COND_MSK                   (TMR2_HCONR_HCLEA0 | TMR2_HCONR_HCLEA1 | TMR2_HCONR_HCLEA2)
#define TMR2_CAPT_COND_MSK                  (TMR2_HCONR_HICPA0 | TMR2_HCONR_HICPA1 | TMR2_HCONR_HICPA2)
#define TMR2_TRIG_COND_MSK                  (TMR2_START_COND_MSK | TMR2_STOP_COND_MSK | TMR2_CLR_COND_MSK | TMR2_CAPT_COND_MSK)
#define TMR2_INT_TYPE_MSK                   (TMR2_ICONR_CMENA | TMR2_ICONR_OVENA)
#define TMR2_COM_TRIG_MSK                   (TMR2_COM_TRIG1 | TMR2_COM_TRIG2)
#define TMR2_TRIG_EVENT_MSK                 (AOS_TMR2_HTSSR_TRGSEL)
/**
 * @}
 */

/**
 * @defgroup TMR2_Channel_Cfg_Bit_Field_Offset TMR2 Channel Configuration Bit Field Offset
 * @{
 */
#define TMR2_BCONR_OFFSET                   (TMR2_BCONR_CSTB_POS)
#define TMR2_ICONR_OFFSET                   (TMR2_ICONR_CMENB_POS)
#define TMR2_PCONR_OFFSET                   (TMR2_PCONR_STACB_POS)
#define TMR2_HCONR_OFFSET                   (TMR2_HCONR_HSTAB0_POS)
/**
 * @}
 */

/**
 * @defgroup TMR2_Register_Bit_Band TMR2 Register Bit Band
 * @{
 */
#define __BIT_BAND_BASE                     (0x42000000UL)
#define __PERIP_BASE                        (0x40000000UL)
#define __REG_OFS(regAddr)                  ((regAddr) - __PERIP_BASE)
#define __BIT_BAND_ADDR(regAddr, pos)       ((__REG_OFS(regAddr) << 5U) + ((uint32_t)(pos) << 2U) + __BIT_BAND_BASE)
#define BIT_BAND(regAddr, pos)              (*(__IO uint32_t *)__BIT_BAND_ADDR((regAddr), (pos)))
/**
 * @}
 */

/**
 * @defgroup TMR2_Check_Parameters_Validity TMR2 check parameters validity
 * @{
 */
#define IS_TMR2_UNIT(x)                                                        \
(   ((x) == M4_TMR2_1)                       ||                                \
    ((x) == M4_TMR2_2)                       ||                                \
    ((x) == M4_TMR2_3)                       ||                                \
    ((x) == M4_TMR2_4))

#define IS_TMR2_CH(x)                                                          \
(   ((x) <= TMR2_CH_B))

#define IS_TMR2_FUNC_MODE(x)                                                   \
(   ((x) == TMR2_FUNC_COMPARE)              ||                                 \
    ((x) == TMR2_FUNC_CAPTURE))

#define IS_TMR2_CLK_SRC(x)                                                     \
(   ((x) == TMR2_CLK_SYNC_PCLK1)            ||                                 \
    ((x) == TMR2_CLK_SYNC_TRIGR)            ||                                 \
    ((x) == TMR2_CLK_SYNC_TRIGF)            ||                                 \
    ((x) == TMR2_CLK_SYNC_EVENT)            ||                                 \
    ((x) == TMR2_CLK_SYNC_TIMER6_OVF)       ||                                 \
    ((x) == TMR2_CLK_SYNC_TIMER6_UDF)       ||                                 \
    ((x) == TMR2_CLK_ASYNC_LRC)             ||                                 \
    ((x) == TMR2_CLK_ASYNC_XTAL32)          ||                                 \
    ((x) == TMR2_CLK_ASYNC_PIN_CLK))

#define IS_TMR2_STATUS_FLAG(x)                                                 \
(   ((x) == TMR2_FLAG_CMP)                  ||                                 \
    ((x) == TMR2_FLAG_OVF))

#define IS_TMR2_CLK_DIV(x)                                                     \
(   ((x) == TMR2_CLK_DIV1)                  ||                                 \
    ((x) == TMR2_CLK_DIV2)                  ||                                 \
    ((x) == TMR2_CLK_DIV4)                  ||                                 \
    ((x) == TMR2_CLK_DIV8)                  ||                                 \
    ((x) == TMR2_CLK_DIV16)                 ||                                 \
    ((x) == TMR2_CLK_DIV32)                 ||                                 \
    ((x) == TMR2_CLK_DIV64)                 ||                                 \
    ((x) == TMR2_CLK_DIV128)                ||                                 \
    ((x) == TMR2_CLK_DIV256)                ||                                 \
    ((x) == TMR2_CLK_DIV512)                ||                                 \
    ((x) == TMR2_CLK_DIV1024))

