RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
#define IS_TMR2_FILTER_CLK_DIV(x)                                              \
(   ((x) == TMR2_FILTER_CLK_DIV1)           ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV4)           ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV16)          ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV64))

#define IS_TMR2_PWM_START_POLARITY(x)                                          \
(   ((x) == TMR2_PWM_START_LOW)             ||                                 \
    ((x) == TMR2_PWM_START_HIGH)            ||                                 \
    ((x) == TMR2_PWM_START_KEEP))

#define IS_TMR2_PWM_STOP_POLARITY(x)                                           \
(   ((x) == TMR2_PWM_STOP_LOW)              ||                                 \
    ((x) == TMR2_PWM_STOP_HIGH)             ||                                 \
    ((x) == TMR2_PWM_STOP_KEEP))

#define IS_TMR2_PWM_CMP_POLARITY(x)                                            \
(   ((x) == TMR2_PWM_CMP_LOW)               ||                                 \
    ((x) == TMR2_PWM_CMP_HIGH)              ||                                 \
    ((x) == TMR2_PWM_CMP_KEEP)              ||                                 \
    ((x) == TMR2_PWM_CMP_REVERSE))

#define IS_TMR2_COM_TRIGGER(x)                                                 \
(   ((x) != 0U)                             &&                                 \
    (((x) | TMR2_COM_TRIG_MSK) == TMR2_COM_TRIG_MSK))

#define IS_TMR2_VALID_VAL(x)                                                   \
(   (x) <= 0xFFFFUL)

/**
 * @}
 */

/**
 * @defgroup TMR2_Miscellaneous_Macros TMR2 Miscellaneous Macros
 * @{
 */
#define TMR2_CH_COUNT                       (2U)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TMR2_Global_Functions TMR2 Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified TMR2 channel according to the specified parameters \
 *         in the structure stc_tmr2_init_t
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  pstcInit               Pointer to a stc_tmr2_init_t structure value that \
 *                                      contains the configuration information for the TMR2 channel.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t TMR2_Init(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, const stc_tmr2_init_t *pstcInit)
{
    uint32_t u32Temp;
    uint32_t u32CMPRAddr;
    uint32_t u32CNTRAddr;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
        DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
        DDL_ASSERT(IS_TMR2_FUNC_MODE(pstcInit->u32FuncMode));
        DDL_ASSERT(IS_TMR2_CLK_SRC(pstcInit->u32ClkSrc));
        DDL_ASSERT(IS_TMR2_CLK_DIV(pstcInit->u32ClkDiv));
        DDL_ASSERT(IS_TMR2_VALID_VAL(pstcInit->u32CmpVal));
        DDL_ASSERT(IS_TMR2_VALID_VAL(pstcInit->u32CntVal));

        u32Temp     = (uint32_t)u8Tmr2Ch * 4U;
        u32CMPRAddr = (uint32_t)&TMR2x->CMPAR + u32Temp;
        u32CNTRAddr = (uint32_t)&TMR2x->CNTAR + u32Temp;
        RW_MEM32(u32CMPRAddr) = pstcInit->u32CmpVal;
        RW_MEM32(u32CNTRAddr) = pstcInit->u32CntVal;

        u32Temp = pstcInit->u32FuncMode | \
                  pstcInit->u32ClkSrc   | \
                  pstcInit->u32ClkDiv;

        /* Channel bit filed offset. */
        u8Tmr2Ch *= TMR2_BCONR_OFFSET;
        MODIFY_REG32(TMR2x->BCONR, (TMR2_BCONR_INIT_MSK << u8Tmr2Ch), (u32Temp << u8Tmr2Ch));

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for TMR2 initialization structure.
 * @param  [in]  pstcInit               Pointer to a stc_tmr2_init_t structure that
 *                                      contains configuration information.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t TMR2_StructInit(stc_tmr2_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        pstcInit->u32FuncMode = TMR2_FUNC_COMPARE;
        pstcInit->u32ClkSrc   = TMR2_CLK_SYNC_PCLK1;
        pstcInit->u32ClkDiv   = TMR2_CLK_DIV1;
        pstcInit->u32CmpVal   = 0xFFFFUL;
        pstcInit->u32CntVal   = 0U;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the specified TMR2 unit.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @retval None
 */
void TMR2_DeInit(M4_TMR2_TypeDef *TMR2x)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));

    TMR2_Stop(TMR2x, TMR2_CH_A);
    TMR2_Stop(TMR2x, TMR2_CH_B);

    CLEAR_REG32(TMR2x->CNTAR);
    CLEAR_REG32(TMR2x->CNTBR);
    CLEAR_REG32(TMR2x->BCONR);
    CLEAR_REG32(TMR2x->ICONR);
    CLEAR_REG32(TMR2x->PCONR);
    CLEAR_REG32(TMR2x->HCONR);
    CLEAR_REG32(TMR2x->STFLR);

    WRITE_REG32(TMR2x->CMPAR, 0xFFFFU);
    WRITE_REG32(TMR2x->CMPBR, 0xFFFFU);
}

/**
 * @brief  Configures the specified channel's PWM output polarity according to the specified \
 *         parameters in the structure stc_tmr2_pwm_cfg_t
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  pstcCfg                Pointer to a stc_tmr2_pwm_cfg_t structure value that contains \
 *                                      the configuration information for the PWM output polarity.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t TMR2_PWM_Config(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, const stc_tmr2_pwm_cfg_t *pstcCfg)
{
    uint32_t u32Cfg;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
        DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
        DDL_ASSERT(IS_TMR2_PWM_START_POLARITY(pstcCfg->u32StartPolarity));
        DDL_ASSERT(IS_TMR2_PWM_STOP_POLARITY(pstcCfg->u32StopPolarity));
        DDL_ASSERT(IS_TMR2_PWM_CMP_POLARITY(pstcCfg->u32CmpPolarity));

