RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
        u32Cfg = pstcCfg->u32StartPolarity | \
                 pstcCfg->u32StopPolarity  | \
                 pstcCfg->u32CmpPolarity;
        u8Tmr2Ch *= TMR2_PCONR_OFFSET;
        MODIFY_REG32(TMR2x->PCONR, (TMR2_PWM_POLARITY_MSK << u8Tmr2Ch), (u32Cfg << u8Tmr2Ch));

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for TMR2 PWM configuration structure.
 * @param  [in]  pstcCfg                Pointer to a stc_tmr2_pwm_cfg_t structure value that contains \
 *                                      the configuration information for the PWM output polarity.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t TMR2_PWM_StructInit(stc_tmr2_pwm_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        pstcCfg->u32StartPolarity = TMR2_PWM_START_HIGH;
        pstcCfg->u32StopPolarity  = TMR2_PWM_STOP_LOW;
        pstcCfg->u32CmpPolarity   = TMR2_PWM_CMP_REVERSE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable PWM output of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  enNewState             An @ref en_functional_state_t value.
 *   @arg  Enable:                      Enable PWM output of the specified TMR2's channel.
 *   @arg  Disable:                     Disable PWM output of the specified TMR2's channel.
 * @retval None
 */
void TMR2_PWM_Cmd(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint8_t au8EnPos[] = {TMR2_PCONR_OUTENA_POS, TMR2_PCONR_OUTENB_POS};

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&TMR2x->PCONR;
    BIT_BAND(u32Addr, au8EnPos[u8Tmr2Ch]) = (uint32_t)enNewState;
}

/**
 * @brief  Specify the channel's hardware trigger condition according to the specified \
 *         parameters in the structure stc_tmr2_trig_cond_t
 * @param  [in]  TMR2x                      Pointer to TMR2 instance register base.
 *                                          This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                       TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                       TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                       TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                       TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch                   The channel number of TMR2.
 *                                          This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                       Channel A of TMR2.
 *   @arg  TMR2_CH_B:                       Channel B of TMR2.
 * @param  [in]  pstcCond                   Pointer to a stc_tmr2_trig_cond_t structure value that contains \
 *                                          the configuration information for the hardware condition.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                              No error occurred.
 *   @arg  ErrorInvalidParameter:           pstcCond == NULL.
 */
en_result_t TMR2_SetTrigCond(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, const stc_tmr2_trig_cond_t *pstcCond)
{
    uint32_t u32Cfg;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCond != NULL)
    {
        DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
        DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));

        u32Cfg  = (pstcCond->u32StartCond | \
                   pstcCond->u32StopCond  | \
                   pstcCond->u32ClrCond   | \
                   pstcCond->u32CaptCond) & TMR2_TRIG_COND_MSK;
        u8Tmr2Ch *= TMR2_HCONR_OFFSET;
        MODIFY_REG32(TMR2x->HCONR, (TMR2_TRIG_COND_MSK << u8Tmr2Ch), (u32Cfg << u8Tmr2Ch));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for TMR2 hardware trigger condition structure.
 * @param  [in]  pstcCond               Pointer to a stc_tmr2_trig_cond_t structure value that contains \
 *                                      the configuration information for the hardware condition.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCond == NULL.
 */
en_result_t TMR2_TrigCondStructInit(stc_tmr2_trig_cond_t *pstcCond)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCond != NULL)
    {
        pstcCond->u32StartCond = TMR2_START_COND_INVALID;
        pstcCond->u32StopCond  = TMR2_STOP_COND_INVALID;
        pstcCond->u32ClrCond   = TMR2_CLR_COND_INVALID;
        pstcCond->u32CaptCond  = TMR2_CAPT_COND_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set trigger source for TMR2.
 * @param  [in]  enEvent                An en_event_src_t enumeration type value.
 * @retval None
 */
void TMR2_SetTriggerSrc(en_event_src_t enEvent)
{
    MODIFY_REG32(M4_AOS->TMR2_HTSSR, TMR2_TRIG_EVENT_MSK, enEvent);
}

/**
 * @brief  Enable or disable common trigger event for the specified usage.
 * @param  [in]  u32ComTrig             Common trigger event enable bit mask.
 *                                      This parameter can be a value of @ref TMR2_Common_Trigger_Sel
 *   @arg  TMR2_COM_TRIG1:              Common trigger 1.
 *   @arg  TMR2_COM_TRIG2:              Common trigger 2.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg Enable:                       Enable the specified common trigger.
 *   @arg Disable:                      Disable the specified common trigger.
 * @retval None
 */
void TMR2_ComTriggerCmd(uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_COM_TRIGGER(u32ComTrig));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == Enable)
    {
        SET_REG32_BIT(M4_AOS->TMR2_HTSSR, u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(M4_AOS->TMR2_HTSSR, u32ComTrig);
    }
}

/**
 * @brief  Set clock divider for the filter of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32ClkDiv              Clock divider for the specified TMR2 unit channel filter.
 *                                      This parameter can be a value of @ref TMR2_Filter_Clock_Divider
 *   @arg  TMR2_FILTER_CLK_DIV1:        Clock source.
 *   @arg  TMR2_FILTER_CLK_DIV4:        Clock source / 4.
 *   @arg  TMR2_FILTER_CLK_DIV16:       Clock source / 16.
 *   @arg  TMR2_FILTER_CLK_DIV64:       Clock source / 64.
 * @retval None
 */
void TMR2_FilterConfig(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32ClkDiv)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_FILTER_CLK_DIV(u32ClkDiv));

    u8Tmr2Ch *= TMR2_PCONR_OFFSET;
    MODIFY_REG32(TMR2x->PCONR, \
                 (TMR2_FILTER_CLK_DIV_MSK << u8Tmr2Ch), \
                 (u32ClkDiv << u8Tmr2Ch));
}

/**
 * @brief  Enable or disable the filter of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  enNewState             An @ref en_functional_state_t value.
 *   @arg  Enable:                      Enable the filter of the specified channel.
 *   @arg  Disable:                     Disable the filter of the specified channel.
 * @retval None
 */
void TMR2_FilterCmd(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint8_t au8EnPos[] = {TMR2_PCONR_NOFIENA_POS, TMR2_PCONR_NOFIENB_POS};

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&TMR2x->PCONR;
    BIT_BAND(u32Addr, au8EnPos[u8Tmr2Ch]) = (uint32_t)enNewState;
}

/**
 * @brief  Enable or disable the interrupt of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32IntType             The interrupt type.
 *                                      This parameter can be a value(s) of @ref TMR2_Interrupt_Type
 *   @arg  TMR2_INT_CMP:                TMR2 count match interrupt.
 *   @arg  TMR2_INT_OVF:                TMR2 count overflow interrupt.
 * @param  [in]  enNewState             An @ref en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified interrupt.
 *   @arg  Disable:                     Disable the specified interrupt.
 * @retval None
 */
void TMR2_IntCmd(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, \
                 uint32_t u32IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

