RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
    u8Tmr2Ch    *= TMR2_ICONR_OFFSET;
    u32IntType  &= TMR2_INT_TYPE_MSK;
    u32IntType <<= u8Tmr2Ch;

    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMR2x->ICONR, u32IntType);
    }
    else
    {
        CLEAR_REG32_BIT(TMR2x->ICONR, u32IntType);
    }
}

/**
 * @brief  Start the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @retval None
 */
void TMR2_Start(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch)
{
    uint32_t au32Cfg[] = {TMR2_BCONR_CSTA, TMR2_BCONR_CSTB};

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    SET_REG32_BIT(TMR2x->BCONR, au32Cfg[u8Tmr2Ch]);
}

/**
 * @brief  Stop the specified channel of the specified TMR2 unit.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @retval None
 */
void TMR2_Stop(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch)
{
    uint32_t au32Cfg[] = {TMR2_BCONR_CSTA, TMR2_BCONR_CSTB};

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    CLEAR_REG32_BIT(TMR2x->BCONR, au32Cfg[u8Tmr2Ch]);
}

/**
 * @brief  Get the specified flag's status of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Flag                TMR2 state flag.
 *                                      This parameter can be values of @ref TMR2_State_Flag
 *   @arg  TMR2_FLAG_CMP:               Counting match flag.
 *   @arg  TMR2_FLAG_OVF:               Counting overflow flag.
 * @retval An en_flag_status_t enumeration type value.
 *   @arg  Set:                         At least one of the specified flags is set.
 *   @arg  Reset:                       None of the specified flags is set.
 */
en_flag_status_t TMR2_GetStatus(const M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Flag)
{
    en_flag_status_t enFlag = Reset;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_STATUS_FLAG(u32Flag));

    u32Flag  &= TMR2_FLAG_ALL;
    u32Flag <<= ((uint32_t)u8Tmr2Ch * TMR2_ICONR_OFFSET);
    if (READ_REG32_BIT(TMR2x->STFLR, u32Flag) != 0U)
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 * @brief  Clear the specified flag state of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Flag                TMR2 state flag.
 *                                      This parameter can be values of @ref TMR2_State_Flag
 *   @arg  TMR2_FLAG_CMP:               Counter match flag of channel A/B.
 *   @arg  TMR2_FLAG_OVF:               Counter overflow flag of channel A/B.
 * @retval None
 */
void TMR2_ClrStatus(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Flag)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));

    /* Bit filed offset. */
    u8Tmr2Ch *= TMR2_ICONR_OFFSET;
    u32Flag  &= TMR2_FLAG_ALL;
    u32Flag <<= u8Tmr2Ch;
    CLEAR_REG32_BIT(TMR2x->STFLR, u32Flag);
}

/**
 * @brief  Set compare value for the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Val                 The compare reference value for the specified TMR2's channel.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMR2_SetCmpVal(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Val)
{
    uint32_t u32CMPRAddr;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_VALID_VAL(u32Val));
    u32CMPRAddr = (uint32_t)&TMR2x->CMPAR + (uint32_t)u8Tmr2Ch * 4U;
    RW_MEM32(u32CMPRAddr) = u32Val;
}

/**
 * @brief  Get compare value of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @retval The compare value of the specified TMR2's channel. A number between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMR2_GetCmpVal(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch)
{
    uint32_t u32CMPRAddr;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));

