RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
    u32CMPRAddr = (uint32_t)&TMR2x->CMPAR + (uint32_t)u8Tmr2Ch * 4U;
    return RW_MEM32(u32CMPRAddr);
}

/**
 * @brief  Set counter value for the specified channel of the specified TMR2 unit.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel of the specified TMR2 unit.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Val                 The counter value for the specified TMR2's channel.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMR2_SetCntVal(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Val)
{
    uint32_t u32CNTRAddr;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_VALID_VAL(u32Val));

    u32CNTRAddr = (uint32_t)&TMR2x->CNTAR + (uint32_t)u8Tmr2Ch * 4U;
    RW_MEM32(u32CNTRAddr) = u32Val;
}

/**
 * @brief  Get counter value of the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @retval The counter value of the specified TMR2's channel. A number between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMR2_GetCntVal(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch)
{
    uint32_t u32CNTRAddr;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    u32CNTRAddr = (uint32_t)&TMR2x->CNTAR + (uint32_t)u8Tmr2Ch * 4U;

    return RW_MEM32(u32CNTRAddr);
}

/**
 * @brief  Set function mode for the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32FuncMode            Specifies the function for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_Function_Mode
 *   @arg  TMR2_FUNC_COMPARE:           Set the function of the specified channel of TMR2 unit as compare output.
 *   @arg  TMR2_FUNC_CAPTURE:           Set the function of the specified channel of TMR2 unit as capturing input.
 * @retval None
 */
void TMR2_SetFuncMode(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32FuncMode)
{
    uint32_t u32Msk;
    uint32_t u32Cfg;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_FUNC_MODE(u32FuncMode));

    /* Bit filed offset. */
    u8Tmr2Ch *= TMR2_BCONR_OFFSET;
    u32Msk    = TMR2_FUNC_MODE_MSK << u8Tmr2Ch;
    u32Cfg    = u32FuncMode << u8Tmr2Ch;
    MODIFY_REG32(TMR2x->BCONR, u32Msk, u32Cfg);
}

/**
 * @brief  Specify the clock source for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32ClkSrc              Specifies the clock source for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_Clock_Source
 *   @arg  TMR2_SYNC_CLK_PCLK1:         Synchronous clock source, PCLK1.
 *   @arg  TMR2_SYNC_CLK_TRIG_RISE:     Synchronous clock source, rising edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_SYNC_CLK_TRIG_FALL:     Synchronous clock source, falling edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_SYNC_CLK_EVENT:         Synchronous clock source, peripheral event.
 *   @arg  TMR2_CLK_SYNC_TIMER6_OVF:    Synchronous clock source, the event of counting overflow of TIMER6. \
 *                                      It is NOT need to set register TMR2_HTSSR.
 *   @arg  TMR2_CLK_SYNC_TIMER6_UDF:    Synchronous clock source, the event of counting underflow of TIMER6. \
 *                                      It is NOT need to set register TMR2_HTSSR.
 *   @arg  TMR2_ASYNC_CLK_LRC:          Asynchronous clock source, LRC.
 *   @arg  TMR2_ASYNC_CLK_XTAL32:       Asynchronous clock source, XTAL32.
 *   @arg  TMR2_ASYNC_CLK_PIN_CLK:      Asynchronous clock source, from pin TIM2_x_CLKA/B.
 * @retval None
 */
void TMR2_SetClkSrc(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32ClkSrc)
{
    uint32_t u32Msk;
    uint32_t u32Cfg;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_CLK_SRC(u32ClkSrc));

    /* Bit filed offset. */
    u8Tmr2Ch *= TMR2_BCONR_OFFSET;
    u32Msk    = TMR2_CLK_SRC_MSK << u8Tmr2Ch;
    u32Cfg    = u32ClkSrc << u8Tmr2Ch;
    MODIFY_REG32(TMR2x->BCONR, u32Msk, u32Cfg);
}

/**
 * @brief  Specify the division of the clock source for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32ClkDiv              Specifies the clock source division for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_Clock_Divider
 *   @arg  TMR2_CLK_DIV1:               Clock source.
 *   @arg  TMR2_CLK_DIV2:               Clock source / 2.
 *   @arg  TMR2_CLK_DIV4:               Clock source / 4.
 *   @arg  TMR2_CLK_DIV8:               Clock source / 8.
 *   @arg  TMR2_CLK_DIV16:              Clock source / 16.
 *   @arg  TMR2_CLK_DIV32:              Clock source / 32.
 *   @arg  TMR2_CLK_DIV64:              Clock source / 64.
 *   @arg  TMR2_CLK_DIV128:             Clock source / 128.
 *   @arg  TMR2_CLK_DIV256:             Clock source / 256.
 *   @arg  TMR2_CLK_DIV512:             Clock source / 512.
 *   @arg  TMR2_CLK_DIV1024:            Clock source / 1024.
 * @retval None
 */
void TMR2_SetClkDiv(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32ClkDiv)
{
    uint32_t u32Msk;
    uint32_t u32Cfg;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_CLK_DIV(u32ClkDiv));

    /* Bit filed offset. */
    u8Tmr2Ch *= TMR2_BCONR_OFFSET;
    u32Msk    = TMR2_CLK_DIV_MSK << u8Tmr2Ch;
    u32Cfg    = u32ClkDiv << u8Tmr2Ch;
    MODIFY_REG32(TMR2x->BCONR, u32Msk, u32Cfg);
}

/**
 * @brief  Enable or disable the specified trigger conditions of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Cond                The specified conditions.
 *                                      This parameter can be a value of
 *                                      @ref TMR2_Hardware_Start_Condition \
 *                                      @ref TMR2_Hardware_Stop_Condition  \
 *                                      @ref TMR2_Hardware_Clear_Condition \
 *                                      @ref TMR2_Hardware_Capture_Condition
 *   @arg  TMR2_START_COND_TRIG_RISE:   The condition of start is the rising edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_START_COND_TRIG_FALL:   The condition of start is the falling edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_START_COND_EVENT:       The condition of start is the specified event occurred.
 *   @arg  TMR2_STOP_COND_TRIG_RISE:    The condition of stop is the rising edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_STOP_COND_TRIG_FALL:    The condition of stop is the falling edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_STOP_COND_EVENT:        The condition of stop is the specified event occurred.
 *   @arg  TMR2_CLR_COND_TRIG_RISE:     The condition of clear(clear CNTAR/CNTBR) is the rising edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_CLR_COND_TRIG_FALL:     The condition of clear(clear CNTAR/CNTBR) is the falling edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_CLR_COND_EVENT:         The condition of clear(clear CNTAR/CNTBR) is the specified event occurred.
 *   @arg  TMR2_CAPT_COND_TRIG_RISE:    The condition for capturing is the rising edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_CAPT_COND_TRIG_FALL:    The condition for capturing is the falling edge of TIM2_x_TRIGA/B.
 *   @arg  TMR2_CAPT_COND_EVENT:        The condition for capturing is the specified event occurred.
 * @param  [in]  enNewState             An @ref en_functional_state_t value.
 *   @arg  Enable:                      Enable the sepcified trigger conditions.
 *   @arg  Disable:                     Disable the sepcified trigger conditions.
 * @retval None
 */
void TMR2_TrigCondCmd(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Cond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

