RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_tmr2.c
    u32Cond  &= TMR2_TRIG_COND_MSK;
    u8Tmr2Ch *= TMR2_HCONR_OFFSET;
    u32Cond <<= u8Tmr2Ch;
    if (enNewState == Enable)
    {
        SET_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
    else
    {
        CLEAR_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
}

/**
 * @brief  Set PWM polarity when counting start for the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Polarity            Specifies the PWM start polarity for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_PWM_Start_Polarity
 *   @arg  TMR2_PWM_START_LOW:          PWM output low when counting start.
 *   @arg  TMR2_PWM_START_HIGH:         PWM output high when counting start.
 *   @arg  TMR2_PWM_START_KEEP:         PWM output keeps the current polarity when counting start.
 * @retval None
 */
void TMR2_PWM_SetStartPolarity(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Polarity)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_PWM_START_POLARITY(u32Polarity));

    u8Tmr2Ch *= TMR2_PCONR_OFFSET;
    MODIFY_REG32(TMR2x->PCONR, \
                 (TMR2_PWM_START_POLARITY_MSK << u8Tmr2Ch), \
                 (u32Polarity << u8Tmr2Ch));
}

/**
 * @brief  Set PWM polarity when counting stop for the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Polarity            Specifies the PWM stop polarity for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_PWM_Stop_Polarity
 *   @arg  TMR2_PWM_STOP_LOW:           PWM output low when counting stop.
 *   @arg  TMR2_PWM_STOP_HIGH:          PWM output high when counting stop.
 *   @arg  TMR2_PWM_STOP_KEEP:          PWM output keeps the current polarity when counting stop.
 * @retval None
 */
void TMR2_PWM_SetStopPolarity(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Polarity)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_PWM_STOP_POLARITY(u32Polarity));

    u8Tmr2Ch *= TMR2_PCONR_OFFSET;
    MODIFY_REG32(TMR2x->PCONR, \
                 (TMR2_PWM_STOP_POLARITY_MSK << u8Tmr2Ch), \
                 (u32Polarity << u8Tmr2Ch));
}

/**
 * @brief  Set PWM polarity when counting compare match for the specified TMR2's channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_TMR2_1:                   TMR2 unit 1 instance register base.
 *   @arg  M4_TMR2_2:                   TMR2 unit 2 instance register base.
 *   @arg  M4_TMR2_3:                   TMR2 unit 3 instance register base.
 *   @arg  M4_TMR2_4:                   TMR2 unit 4 instance register base.
 * @param  [in]  u8Tmr2Ch               The channel number of TMR2.
 *                                      This parameter can be a value of @ref TMR2_Channel_Number
 *   @arg  TMR2_CH_A:                   Channel A of TMR2.
 *   @arg  TMR2_CH_B:                   Channel B of TMR2.
 * @param  [in]  u32Polarity            Specifies the PWM count match polarity for the specified TMR2's channel.
 *                                      This parameter can be a value of @ref TMR2_PWM_Cmp_Polarity
 *   @arg  TMR2_PWM_CMP_LOW:            PWM output low when counting compare match.
 *   @arg  TMR2_PWM_CMP_HIGH:           PWM output high when counting compare match.
 *   @arg  TMR2_PWM_CMP_KEEP:           PWM output keeps the current polarity when counting compare match.
 *   @arg  TMR2_PWM_CMP_REVERSE:        PWM output reverses the current polarity when counting compare match.
 * @retval None
 */
void TMR2_PWM_SetCmpPolarity(M4_TMR2_TypeDef *TMR2x, uint8_t u8Tmr2Ch, uint32_t u32Polarity)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u8Tmr2Ch));
    DDL_ASSERT(IS_TMR2_PWM_CMP_POLARITY(u32Polarity));

    u8Tmr2Ch *= TMR2_PCONR_OFFSET;
    MODIFY_REG32(TMR2x->PCONR, \
                 (TMR2_PWM_CMP_POLARITY_MSK << u8Tmr2Ch), \
                 (u32Polarity << u8Tmr2Ch));
}

/**
 * @}
 */

#endif /* DDL_TMR2_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
